### test01 - Terraform Plan
#### Terraform Initialization success
#### Terraform Validation success
#### Terraform Format and Style success
#### Terraform Plan success

<details><summary>test01 - Plan</summary>

terraform
module.mod2.aws_ssm_parameter.favourite: Refreshing state... [id=colour]
module.mod1.aws_ssm_parameter.favourite: Refreshing state... [id=food]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mod1.aws_ssm_parameter.favourite must be replaced
-/+ resource "aws_ssm_parameter" "favourite" {
      ~ arn            = "arn:aws:ssm:eu-west-2:680805529666:parameter/food" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "food" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "food" -> "/tftest/test01/food" # forces replacement
      - overwrite      = false -> null
      ~ tags           = {
          ~ "Name"             = "food" -> "/tftest/test01/food"
          - "account"          = "dev" -> null
          - "account_full"     = "Dev Environment" -> null
          - "environment"      = "dev01" -> null
          - "environment_full" = "Dev env 1" -> null
        }
      ~ tags_all       = {
          ~ "Name"             = "food" -> "/tftest/test01/food"
          ~ "account"          = "dev" -> "test"
          ~ "account_full"     = "Dev Environment" -> "Test Environment"
          ~ "environment"      = "dev01" -> "test01"
          ~ "environment_full" = "Dev env 1" -> "Test env 1"
            # (7 unchanged elements hidden)
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 19 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.mod2.aws_ssm_parameter.favourite must be replaced
-/+ resource "aws_ssm_parameter" "favourite" {
      ~ arn            = "arn:aws:ssm:eu-west-2:680805529666:parameter/colour" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "colour" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "colour" -> "/tftest/test01/colour" # forces replacement
      - overwrite      = false -> null
      ~ tags           = {
          ~ "Name"             = "colour" -> "/tftest/test01/colour"
          - "account"          = "dev" -> null
          - "account_full"     = "Dev Environment" -> null
          - "environment"      = "dev01" -> null
          - "environment_full" = "Dev env 1" -> null
        }
      ~ tags_all       = {
          ~ "Name"             = "colour" -> "/tftest/test01/colour"
          ~ "account"          = "dev" -> "test"
          ~ "account_full"     = "Dev Environment" -> "Test Environment"
          ~ "environment"      = "dev01" -> "test01"
          ~ "environment_full" = "Dev env 1" -> "Test env 1"
            # (7 unchanged elements hidden)
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 19 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...



</details>

* Triggered by: @AntonyPotter, Action: pull_request